cubic と、(newtons-method (cubic a b c) 1) の結果を (cubic a b c) に適用する cubic-test を定義。

    > (cubic-test 3 4 5)
    1.8474111129762605e-013
    0.00000000000018474111129762605
    
    > (cubic-test -1 -10 -100)
    1.1999645721516572e-009
    0.0000000011999645721516572

    > (cubic-test 100 10 7)
    -5.877609510207549e-011
    -0.00000000005877609510207549

    > (cubic-test 23 72 485)
    -2.2737367544323206e-013
    -0.00000000000022737367544323206

    > (cubic-test -612 75 13)
    -5.711406458885904e-008
    -0.00000005711406458885904

どれも 0 の近似値になっているので cubic の定義はあってると思われる。
